tap "homebrew/bundle"
tap "argon/mas"
tap "github/gh"
tap "homebrew/cask-fonts"

brew "python3"
brew "ruby"
brew "nvm"
brew "coreutils"
brew "gh"
brew "git"
brew "minikube"
brew "terraform"
brew "direnv"
brew "bat"
brew "peco"
brew "fzf"
brew "htop"
brew "httpie"
brew "redis"
brew "jid"
brew "jq"
brew "lsd"
brew "the_silver_searcher"
brew "tree"
brew "wget"
brew "z"
brew "git-delta"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-community-shell"
brew "mongodb/brew/mongodb-database-tools"

cask "google-chrome"
cask "iterm2"
cask "visual-studio-code"
cask "alfred"
cask "notion"
cask "font-hack-nerd-font"
cask "docker"
cask "dbeaver-community"
cask "rectangle"

mas "1Password 7", id: 1333542190
mas "PopClip", id: 445189367
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
